---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.OptionElementsDeleted
source: html/81caa3e1-5f0f-5775-3b0b-b7d9349a1464.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.OptionElementsDeleted Property

Elements in [option] were deleted

## Syntax (C#)
```csharp
public static FailureDefinitionId OptionElementsDeleted { get; }
```